{
    "data_paths": "[/home/dataset_train]",
    "output_dir": "/home/output/",
    "tb_dir": "/home/tensorboard/",
    "pretrained_model_path": "codellama/CodeLlama-34b-Instruct-hf",
    "model_type": "llama",
    "load_raw_dataset": true,
    "data_split": "98,2,0",
    "padding_mode": "padding",
    "use_dynamic_padding": true,
    "tokenize_mode": "sft",
    "tokenizer_type": "AutoTokenizer",
    "weighted_loss_mode": "case3",
    "attn_implementation": "eager",
    "seq_length": 3300,
    "seed": 1234,
    "peft_type": "qlora",
    "quantization": "4bit",
    "lora_rank": 96,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "per_device_train_batch_size": 1,
    "per_device_eval_batch_size": 1,
    "learning_rate": 1e-3,
    "min_lr": 5e-4,
    "weight_decay": 0.1,
    "gradient_accumulation_steps": 1,
    "lr_scheduler_type": "cosine",
    "num_warmup_steps": 100,
    "num_train_epochs": 200,
    "resume_from_checkpoint": "/home/checkpoints_codellama/step_14400",
    "log_interval": 10,
    "checkpointing_steps": 200,
    "evaluation_steps": 100,
    "max_train_steps": null,
    "epoch_checkpointing": true,
    "shuffle_before_split": true,
    "early_stopping": false,
    "early_stopping_stall_num": 5,
    "saving_limit": null
}